cf/Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/InformationRegisters/ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ШтрихКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипШтрихКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыШтрихКодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнформационнаяКарта_УДАЛИТЬ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Documents/УстановкаЦенНоменклатуры/Forms/ЗагрузкаExcel/Ext/Form/Module.bsl
&НаСервере
Функция ДобавитьПолеФормы(Имя, Группа, Заголовок = "", ВидПоля = Неопределено, ПоложениеЗаголовка = Неопределено)
	                      // уникальное имя     тип      родитель       
	НовоеПоле = Элементы.Добавить(Имя, Тип("ПолеФормы"), Группа);	
	НовоеПоле.ПутьКДанным = Имя;
	НовоеПоле.Заголовок = Заголовок;
	НовоеПоле.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
	НовоеПоле.Вид = ?(ВидПоля <> Неопределено, ВидПоля, ВидПоляФормы.ПолеВвода);
	
	Если ПоложениеЗаголовка <> Неопределено Тогда
		НовоеПоле.ПоложениеЗаголовка = ПоложениеЗаголовка;
	КонецЕсли;
	
	Возврат НовоеПоле;
	
КонецФункции

&НаСервере
Процедура ДобавитьРеквизиты(СоответствияИмен);
	
	НовыеРеквизиты = Новый Массив;

	Для Каждого Элемент Из СоответствияИмен Цикл
		ИмяРеквизита = Элемент.Ключ;
		НовыеРеквизиты.Добавить(Новый РеквизитФормы("Номер" + ИмяРеквизита, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5))));
		НовыеРеквизиты.Добавить(Новый РеквизитФормы("Валюта" + ИмяРеквизита, Новый ОписаниеТипов("СправочникСсылка.Валюты")));
 	КонецЦикла;
    ИзменитьРеквизиты(НовыеРеквизиты); 
	
	Для Каждого Элемент Из СоответствияИмен Цикл
		ИмяРеквизита = Элемент.Ключ;
		ДобавитьПолеФормы("Номер" + ИмяРеквизита, Элементы.ГруппаНомеров, " - " + Элемент.Значение,, ПоложениеЗаголовкаЭлементаФормы.Право);
		ДобавитьПолеФормы("Валюта" + ИмяРеквизита, Элементы.ГруппаВалют, " в валюте ");
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СоответствиеТиповЦен = ВладелецФормы.ПолучитьСоответствияИменКолонок();
	ДобавитьРеквизиты(СоответствиеТиповЦен);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВ.Фильтр =  "Эксель (*.xls)|*.xls*";
	
	Если ДВ.Выбрать() Тогда
		
		ИмяФайла = ДВ.ПолноеИмяФайла;
		
	КонецЕсли;


КонецПроцедуры
&НаСервере
Функция НайтиНоменклатуру(АртикулКодШтрихКод, СоответствиеТиповЦен, стрОшибки = "")
	
	Если ПолеПоиска = 0 Тогда 
    КлючевоеПоле = "Артикул";
    ИначеЕсли ПолеПоиска = 1 Тогда
    КлючевоеПоле = "Код";
    ИначеЕсли ПолеПоиска = 2 Тогда
	КлючевоеПоле = "Код2";
    ИначеЕсли ПолеПоиска = 3 Тогда
	КлючевоеПоле = "ШтрихКод";
	ИначеЕсли ПолеПоиска = 4 Тогда
	КлючевоеПоле = "АртикулПоставщика";
    КонецЕсли;

	Если ПолеПоиска = 3 Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	ШтрихКоды.Объект.Ссылка КАК Ссылка,
		               |	ШтрихКоды.Объект.Артикул КАК Артикул,
		               |	ШтрихКоды.ШтрихКод КАК АртикулКодШтрихКод
		               |ИЗ
		               |	РегистрСведений.ШтрихКоды КАК ШтрихКоды
		               |ГДЕ
		               |	ШтрихКоды.ШтрихКод = &ШтрихКод
		               |	И ВЫБОР
		               |			КОГДА &Производитель = &ПустойПроизводитель
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ ШтрихКоды.Объект.Производитель = &Производитель
		               |		КОНЕЦ";
					   Запрос.УстановитьПараметр("ШтрихКод",АртикулКодШтрихКод);
	Иначе

	
      Запрос = Новый Запрос("ВЫБРАТЬ "+КлючевоеПоле+" КАК АртикулКодШтрихКод, Артикул, Ссылка ИЗ Справочник.Номенклатура ГДЕ "+КлючевоеПоле+" = """ + АртикулКодШтрихКод + """ и Выбор когда &Производитель = &ПустойПроизводитель  тогда Истина Иначе Производитель = &Производитель конец");
	    	
    КонецЕсли;

    Запрос.УстановитьПараметр("Производитель",Производитель);
	Запрос.УстановитьПараметр("ПустойПроизводитель", Справочники.Производители.ПустаяСсылка());

	Попытка                      // мало ли что подусунули в артикул...
		Рез = Запрос.Выполнить();
	Исключение
		стрОшибки = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	
	Если НЕ Рез.Пустой() Тогда
		
		Выборка = Рез.Выбрать();
		Если Выборка.Следующий() Тогда
			
			СтруктураРезультата = Новый Структура("АртикулКодШтрихКод,Артикул, Номенклатура", Выборка.АртикулКодШтрихКод, Выборка.Артикул, Выборка.Ссылка);
			
			Для Каждого Элемент Из СоответствиеТиповЦен Цикл
				ИмяКолонки = Элемент.Значение;
				СтруктураРезультата.Вставить("Цена" + ИмяКолонки, РаботаСНоменклатурой.ПолучитьЦену(Выборка.Ссылка, Элемент.Ключ, ЭтаФорма["Валюта" + ИмяКолонки]));	
			КонецЦикла;

			Возврат СтруктураРезультата; 
		КонецЕсли;
	КонецЕсли;
	
	стрОшибки = "Не найдено ни одного товара с артикулом/кодом/штрихкодом " + АртикулКодШтрихКод;
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьЦенуТовара(Ссылка, ТипЦен)
КонецФункции

&НаКлиенте
Процедура ЗагрузитьДанные(Эксель)
	
	Таблица = ВладелецФормы.ТаблицаТоваров;
	стрОшибки = "";
	
	СоответствиеТиповЦен = ВладелецФормы.ПолучитьСоответствияТиповЦен();
	
	Лист = Эксель.Worksheets(1);
	КолВоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
	НомерСтр = Таблица.количество() + 1;
	Для Сч = 2 По КолВоСтрок Цикл // первая строка - заголовок
		
		СтрокаАртикул = СокрЛП(Формат(Лист.Cells(Сч, КолонкаАртикул).Value,"ЧГ=0"));
		
		Если ПустаяСтрока(СтрокаАртикул) Тогда
			Сообщить("Строка #" + Строка(Сч) + ": Не указан артикул/код/штрихкод товара. Выгрузка данных по этой строке не произведена");
	        Продолжить;
		КонецЕсли;

		Рез =  НайтиНоменклатуру(СтрокаАртикул, СоответствиеТиповЦен, стрОшибки);
		Если Рез = Неопределено Тогда
			Сообщить("Не существует товара с артикулом/кодом/штрихкодом, " + СтрокаАртикул + " или он не соответствует отбору.");
			Продолжить;
		КонецЕсли;
			
		Строка = Таблица.Добавить();
		Строка.Номенклатура = Рез.Номенклатура;
		Строка.НомерСтроки	= НомерСтр;
		
		
		Для Каждого Элемент Из СоответствиеТиповЦен Цикл
			
			ИмяКолонки = Элемент.Значение;
	        ТекущийНомерКолонки  = ЭтаФорма["Номер" + ИмяКолонки];
			
			Если  ТекущийНомерКолонки <> 0 Тогда
				
				Строка["СтараяЦен" + ИмяКолонки] = Рез["Цена" + ИмяКолонки];
				Строка["Валюта" + ИмяКолонки] =  ЭтаФорма["Валюта" + ИмяКолонки];
	 			
				Попытка 
					Строка["Цена" + ИмяКолонки] = Число(СокрЛП(Лист.Cells(Сч, ТекущийНомерКолонки).Value));
				Исключение
					Строка["Цена" + ИмяКолонки]= 0;
					Сообщить("Колонка """ + Строка(Элемент.Ключ)+ """ - Ошибка преобразования значения ячейки к числовому типу данных: " + Строка.Номенклатура);
					Продолжить;
				КонецПопытки;
			КонецЕсли;
			
		КонецЦикла;
     НомерСтр = НомерСтр + 1;
	КонецЦикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	
	Если ПустаяСтрока(ИмяФайла) Тогда
		ОбщиеФункции.СообщитьТекст("Не выбран файл", "ИмяФайла", ЭтаФорма);
		Возврат;
	КонецЕсли;
		
	// Получим эксель
	стрОшибки = "";	         
	Эксель = COMФункцииДиалогов.ОткрытьФайлЭкселя(ИмяФайла, стрОшибки);
	
	Если Эксель = Неопределено Тогда
		ОбщиеФункции.СообщитьТекст(стрОшибки);
		Возврат;
	КонецЕсли;
	                      
	ЗагрузитьДанные(Эксель);
	
	COMФункцииДиалогов.ЗакрытьЭксель(Эксель);
	Сообщить("Данные загружены.");

КонецПроцедуры
